###Типы данных
#Целочисленные
integer = [1,2,3,4,5]
#Строки
string = ["hello", 'hi']
#Числа с плавающей точкой
float_ = [1.2,1.123131232]
#Булево значение , правда или ложь если по-другому
bull = [True, False]
#Списки
lists = [[1,2,3],["hell","o"]]
#Кортежи, тоже самое, что список, только в отличии от списка котреж неизменяем
cortegh = {1,23,4,4,54,5,45,}
#Словарь
dictionaries = {'asd':123}


### Операции над типами данных
## Операции над числами


#Сложение
print(1 + 2) # Программа выведет 3
#Вычитание
print(2 - 1) # Программа выведет 1
#Умножение
print(2 * 3) # Программа выведет 6
#Деление
print(6 / 2) # Программа выведет 3
#Степень
print(2 ** 2) # Программа выведет 4
#Целочисленное деление
print(13 // 2) # Программа выведет 6
#Остаток
print(13 % 2) # Программа выведет 1

## Операции над строками
#Сложение
print('Hello'+'World') # Выводом будет HelloWorld
#Умножение
print('Hello'*3) # Выводом будет HelloHelloHello
#Получение длинны строки
print(len('Hello')) # Выводом будет 5(т.к. букв в этом слове тоже 5)
#Также можно обратиться к определенной букве в слове
print('Hello'[0]) # Выводом будет H
#Также можно слово вывести наоборот
print('Hello'[::-1])
#Вывести ту же строку только в нижнем регистре
print('Hello'.lower())
#Тоже самое только в большом
print('Hello'.upper())

### По поводу Float, с ним те же самые операции, что и с Interger. А вот у Булевых значений их нету

##Операции над списками
##
